Австралия/src/Catalogs/BarcodeScanningActions/BarcodeScanningActions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BarcodeScanningActions</name>
  <attributes>
    <name>DocumentType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>Action</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ChangingAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Change</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>30</precision>
          <scale>10</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OperationKind</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/BarcodeScanningEvents/BarcodeScanningEvents.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BarcodeScanningEvents</name>
  <dimensions>
    <name>UserGroup</name>
    <type>
      <types>CatalogRef.UserGroups</types>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DocumentType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Action</name>
    <type>
      <types>CatalogRef.BarcodeScanningActions</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/ChartsOfCharacteristicTypes/AdditionalAttributesAndInfo/AdditionalAttributesAndInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>AdditionalAttributesAndInfo</name>
  <type>
    <types>CatalogRef.BusinessUnits</types>
    <types>CatalogRef.Products</types>
    <types>CatalogRef.ObjectPropertyValueHierarchy</types>
    <types>Boolean</types>
    <types>CatalogRef.ObjectsPropertiesValues</types>
    <types>CatalogRef.Individuals</types>
    <types>String</types>
    <types>CatalogRef.Users</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Counterparties</types>
    <types>CatalogRef.Employees</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Visible</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesOwner</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
    </type>
  </attributes>
  <attributes>
    <name>OutputAsHyperlink</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesUsed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesWithWeight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Available</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValueSelectionFormTitle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValueFormTitle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RequiredToFill</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MultilineInputField</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInfoSets</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolTip</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteSubjectDeclensions</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FormatProperties</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAdditionalInfo</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributesDependencies</name>
    <attributes>
      <name>DependentProperty</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Австралия/src/Catalogs/BarcodeScanningActions/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

&AtClient
Procedure OnOpen(Cancel)
	DocumentType = DocumentTypeSynonim(Object.DocumentType);
	FormManagement();
	DriveClientServer.SetListFilterItem(BarcodeScanningEvents, "Action", Object.Ref);
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	DriveClientServer.SetListFilterItem(BarcodeScanningEvents, "Action", Object.Ref);
	FormManagement();
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure DocumentTypeStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	NotifyDescription = New NotifyDescription("ChangingDocumentTypeSelectionMade", ThisObject);
	FormParameters = New Structure;
	FormParameters.Insert("CurrentObject", Object.DocumentType);
	OpenForm("Catalog.BarcodeScanningActions.Form.DocumentTypeSelection", FormParameters, , , , , NotifyDescription);

EndProcedure

&AtClient
Procedure ActionOnChange(Item)
	FormManagement();
	FillChangingAttributesTable();
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region ChangingAttributesFormTableItemsEventHandlers

&AtClient
Procedure ChangingAttributesBeforeAddRow(Item, Cancel, Clone, Parent, Folder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure ChangingAttributesBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure ChangingAttributesBeforeRowChange(Item, Cancel)
	If Item.CurrentItem.Name = "ChangingAttributesValue" Then
		Item.CurrentItem.TypeRestriction = ItemTypeRestriction(Object.DocumentType, Item.CurrentData.Attribute, Item.CurrentData.OperationKind);
	EndIf;
EndProcedure

&AtClient
Procedure ChangingAttributesValueOnChange(Item)
	CurrentData = Item.Parent.CurrentData;
	CurrentData.Change = ValueIsFilled(CurrentData.Value);
EndProcedure

&AtClient
Procedure ChangingAttributesChangeOnChange(Item)
	CurrentData = Item.Parent.CurrentData;
	CurrentData.Value = ?(CurrentData.Change, CurrentData.Value, Undefined);
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure CreateBarcodeScanningEvent(Command)
	If Object.Ref.IsEmpty() Then
		ShowMessageBox(, NStr("en = 'You cannot assign the action until the data is saved.'; ru = 'Необходимо сохранить данные для того, чтобы назначить действие.';pl = 'Nie możesz przypisać akcji, dopóki dane nie zostaną zapisane.';es_ES = 'No puede asignar la acción hasta que se guarden los datos.';es_CO = 'No puede asignar la acción hasta que se guarden los datos.';tr = 'Veriler kaydedilmeden eylemi atayamazsınız.';it = 'Impossibile assegnare l''azione prima del salvataggio dei dati.';de = 'Sie können die Aktion erst dann zuordnen, wenn die Daten gesichert sind.'"));
	Else
		ActionFilter = New Structure;
		ActionFilter.Insert("Action", Object.Ref);
		ParametersStructure = New Structure;
		ParametersStructure.Insert("FillingValues", ActionFilter);
		OpenForm("InformationRegister.BarcodeScanningEvents.RecordForm", ParametersStructure);
	EndIf;
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure ChangingDocumentTypeSelectionMade(SelectedObject, AdditionalParameters) Export
	If SelectedObject <> Undefined AND Object.DocumentType <> SelectedObject Then
		Object.DocumentType = SelectedObject;
		DocumentType = DocumentTypeSynonim(Object.DocumentType);
		FillChangingAttributesTable();
	EndIf;
EndProcedure

&AtServerNoContext
Function DocumentTypeSynonim(DocumentType) Export
	Return Common.ObjectAttributeValue(DocumentType, "Synonym");
EndFunction

&AtClient
Procedure FormManagement()
	Items.Attributes.Visible = Object.Action;
	Items.DocumentType.Enabled = Object.Ref.IsEmpty();
EndProcedure

&AtServer
Procedure FillChangingAttributesTable()
	
	Object.ChangingAttributes.Clear();
	If Object.Action And ValueIsFilled(Object.DocumentType) Then
		
		MetadataObject = Common.MetadataObjectByID(Object.DocumentType);
		ObjectEmptyRefValue = Common.ObjectAttributeValue(Object.DocumentType, "EmptyRefValue");
		
		For Each Attribute In MetadataObject.Attributes Do
			NewLine					= Object.ChangingAttributes.Add();
			NewLine.Attribute		= Attribute.Name;
			NewLine.Presentation	= ?(Attribute.Synonym="", Attribute.Name, Attribute.Synonym);
			NewLine.OperationKind	= 1;
		EndDo;
		
		Object.ChangingAttributes.Sort("Presentation");
		
		MetadataObjectName = MetadataObject.Name;
		MetadataObjectKind = Common.ObjectKindByRef(ObjectEmptyRefValue);
		ItemName = MetadataObjectKind + "_" + MetadataObjectName;
		AdditionalAttribute = Catalogs.AdditionalAttributesAndInfoSets.FindByDescription(ItemName);

		If Not AdditionalAttribute.IsEmpty() Then
		
			AdditionalAttributes = PropertyManager.ObjectProperties(ObjectEmptyRefValue, True, False);
			If ValueIsFilled(AdditionalAttributes) Then
				For Each Attribute In AdditionalAttributes Do
					NewLine					= Object.ChangingAttributes.Add();
					NewLine.Attribute		= Attribute.Description;
					NewLine.Presentation	= Attribute.Description;
					NewLine.OperationKind	= 2;
				EndDo;
			EndIf;
			
			AdditionalInformation = PropertyManager.ObjectProperties(ObjectEmptyRefValue, False, True);
			If ValueIsFilled(AdditionalInformation) Then
				For Each Attribute In AdditionalInformation Do
					NewLine					= Object.ChangingAttributes.Add();
					NewLine.Attribute		= Attribute.Description;
					NewLine.Presentation	= Attribute.Description;
					NewLine.OperationKind	= 3;
				EndDo;
			EndIf;
		
		EndIf;
		
	EndIf;
	
EndProcedure

&AtServerNoContext
Function ItemTypeRestriction(DocumentType, Attribute, OperationKind)
	
	TypeRestriction = New TypeDescription("String");
	
	If OperationKind = 1 Then
		MetadataObject = Common.MetadataObjectByID(DocumentType);
		TypeRestriction = MetadataObject.Attributes[Attribute].Type;
	Else
		AdditionalAttribute = ChartsOfCharacteristicTypes.AdditionalAttributesAndInfo.FindByDescription(Attribute);
		TypeRestriction = AdditionalAttribute.ValueType;
	EndIf;
	
	Return TypeRestriction;
	
EndFunction

#EndRegion
